open-vela/contest2026_441_buzhidaojiaoshenmemingzi/chips/bk7258/cp/bk7258_ap_control.c
/****************************************************************************
 * chips/bk7258/cp/bk7258_ap_control.c
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * CPU0 control wrapper for the physical CPU1 AP NuttX image.
 ****************************************************************************/

/****************************************************************************
 * Included Files
 ****************************************************************************/

#include <nuttx/config.h>

#include <errno.h>
#include <stdbool.h>
#include <stdint.h>
#include <string.h>

#include <nuttx/arch.h>
#include <nuttx/clock.h>
#include <nuttx/mutex.h>
#include <nuttx/signal.h>

#include <arch/chip/bk7258_amp.h>

#if defined(CONFIG_BK7258_BT_IPC) && defined(CONFIG_BK7258_RPTUN_MBOX)
#  include <arch/chip/bk7258_bt_ipc.h>
#endif
#ifdef CONFIG_BK7258_WIFI_VNET
#  include <arch/chip/bk7258_wifi.h>
#endif

#ifdef CONFIG_BK7258_PSRAM
#  include <arch/chip/bk7258_psram.h>
#endif

#ifdef CONFIG_BK7258_RPTUN_MBOX
#  include <arch/chip/bk7258_rptun.h>
#  include "bk7258_rptun_mbox.h"
#endif
#ifdef CONFIG_BK7258_RPTUN
#  include "bk7258_rptun.h"
#endif

/****************************************************************************
 * External Function Prototypes
 ****************************************************************************/

/* These routines are provided by the pinned Beken CP SDK archives. */

#define BK7258_SDK_PM_POWER_MODULE_CPU1 17u
#define BK7258_SDK_PM_POWER_ON          0u

extern int bk_pm_module_vote_power_ctrl(unsigned int module,
                                        unsigned int power_state);
extern void sys_drv_set_cpu1_pwr_dw(uint32_t is_pwr_down);
extern void sys_drv_set_cpu1_rxevt_sel(uint32_t value);
extern void sys_drv_set_cpu1_boot_address_offset(uint32_t address_offset);
extern void sys_drv_set_cpu1_reset(uint32_t reset_value);
extern void sys_drv_set_cpu2_pwr_dw(uint32_t is_pwr_down);
extern void sys_drv_set_cpu2_rxevt_sel(uint32_t value);
extern void sys_drv_set_cpu2_boot_address_offset(uint32_t address_offset);
extern void sys_drv_set_cpu2_reset(uint32_t reset_value);

/****************************************************************************
 * Private Data
 ****************************************************************************/

/* Singleton SoC CPU1 control state.  The mutex serializes SYS register and
 * shared-state transitions issued by concurrent NSH callers.
 */

static mutex_t g_bk7258_ap_lock = NXMUTEX_INITIALIZER;
static bool g_bk7258_ap_initialized;
static bool g_bk7258_ap_live_this_boot;
static bool g_bk7258_ap_faulted;
static struct bk7258_ap_image_desc_s g_bk7258_ap_image;

static bool bk7258_ap_image_valid(
  const struct bk7258_ap_image_desc_s *image)
{
  return image != NULL && image->slot_start < image->slot_end &&
         image->vector_addr >= image->slot_start &&
         image->vector_addr < image->slot_end &&
         image->slot_end - image->vector_addr >= 0x140u &&
         (image->vector_addr & 0x1ffu) == 0;
}

/****************************************************************************
 * Private Functions
 ****************************************************************************/

static void bk7258_cpu1_sdk_stop(void)
{
  /* Match SDK reset_cpu1_core(0, 0), which is also the hardware part of
   * stop_cpu1_core().  Keep the SDK's power-up-before-reset ordering: the
   * pwr_dw bit is not a reliable substitute for asserting the CPU reset.
   */

  sys_drv_set_cpu1_pwr_dw(0);
  sys_drv_set_cpu1_rxevt_sel(1);
  sys_drv_set_cpu1_boot_address_offset(0);
  sys_drv_set_cpu1_reset(0);
  __asm volatile ("dsb sy; isb sy" ::: "memory");
}

static void bk7258_cpu2_sdk_stop(void)
{
  /* Match SDK reset_cpu2_core(0, 0), which is also stop_cpu2_core().  Use
   * the SDK system-driver wrappers so their register critical sections and
   * bitfield ownership remain authoritative.
   */

  sys_drv_set_cpu2_pwr_dw(0);
  sys_drv_set_cpu2_rxevt_sel(1);
  sys_drv_set_cpu2_boot_address_offset(0);
  sys_drv_set_cpu2_reset(0);
  __asm volatile ("dsb sy; isb sy" ::: "memory");
}

#ifdef CONFIG_BK7258_RPTUN_MBOX
static int bk7258_ap_mbox_initialize(void)
{
  return bk7258_rptun_mbox_initialize();
}

static void bk7258_ap_mbox_send(uint32_t event)
{
  volatile struct bk7258_ap_boot_state_s *state = bk7258_ap_boot_state();

  if (bk7258_rptun_mbox_send(BK7258_RPTUN_MBOX_LIFECYCLE,
                             state->generation, event) >= 0)
    {
      state->cp_to_ap_doorbells++;
    }

  __asm volatile ("dmb sy" ::: "memory");
}

static uint32_t bk7258_ap_mbox_receive(void)
{
  return bk7258_rptun_mbox_take_lifecycle();
}
#else
static inline volatile uint32_t *bk7258_ap_mbox(uint32_t base)
{
  return (volatile uint32_t *)(uintptr_t)base;
}

static void bk7258_ap_mbox_ack(volatile uint32_t *mbox)
{
  mbox[BK7258_MBOX_CLEAR_OFFSET / 4] = BK7258_MBOX_BOX0_BIT;
  __asm volatile ("dsb sy" ::: "memory");
  mbox[BK7258_MBOX_READY_OFFSET / 4] = 0;
  mbox[BK7258_MBOX_CLEAR_OFFSET / 4] = 0;
  __asm volatile ("dsb sy" ::: "memory");
}

static int bk7258_ap_mbox_initialize(void)
{
  volatile uint32_t *to_ap = bk7258_ap_mbox(BK7258_MBOX0_BASE);
  volatile uint32_t *to_cp = bk7258_ap_mbox(BK7258_MBOX1_BASE);

  to_ap[BK7258_MBOX_CLKRST_OFFSET / 4] = 1u;
  to_cp[BK7258_MBOX_CLKRST_OFFSET / 4] = 1u;
  to_ap[BK7258_MBOX_SENDER_OFFSET / 4] = 1u << 0;
  to_ap[BK7258_MBOX_RECEIVER_OFFSET / 4] = 1u << 1;
  to_cp[BK7258_MBOX_SENDER_OFFSET / 4] = 1u << 1;
  to_cp[BK7258_MBOX_RECEIVER_OFFSET / 4] = 1u << 0;

  bk7258_ap_mbox_ack(to_ap);
  bk7258_ap_mbox_ack(to_cp);
  return OK;
}

static void bk7258_ap_mbox_send(uint32_t event)
{
  volatile uint32_t *mbox = bk7258_ap_mbox(BK7258_MBOX0_BASE);
  volatile struct bk7258_ap_boot_state_s *state = bk7258_ap_boot_state();

  if ((mbox[BK7258_MBOX_READY_OFFSET / 4] &
       BK7258_MBOX_BOX0_BIT) != 0)
    {
      bk7258_ap_mbox_ack(mbox);
    }

  mbox[BK7258_MBOX_PARAM0_OFFSET / 4] = BK7258_AP_DOORBELL_MAGIC;
  mbox[BK7258_MBOX_PARAM1_OFFSET / 4] = event;
  mbox[BK7258_MBOX_PARAM2_OFFSET / 4] = state->generation;
  mbox[BK7258_MBOX_PARAM3_OFFSET / 4] = state->command;
  __asm volatile ("dmb sy" ::: "memory");
  mbox[BK7258_MBOX_READY_OFFSET / 4] = BK7258_MBOX_BOX0_BIT;
  state->cp_to_ap_doorbells++;
  __asm volatile ("dsb sy; sev" ::: "memory");
}

static uint32_t bk7258_ap_mbox_receive(void)
{
  volatile uint32_t *mbox = bk7258_ap_mbox(BK7258_MBOX1_BASE);
  volatile struct bk7258_ap_boot_state_s *state = bk7258_ap_boot_state();
  uint32_t event = BK7258_AP_EVENT_NONE;

  if ((mbox[BK7258_MBOX_READY_OFFSET / 4] &
       BK7258_MBOX_BOX0_BIT) != 0)
    {
      if (mbox[BK7258_MBOX_PARAM0_OFFSET / 4] ==
          BK7258_AP_DOORBELL_MAGIC &&
          mbox[BK7258_MBOX_PARAM2_OFFSET / 4] == state->generation)
        {
          event = mbox[BK7258_MBOX_PARAM1_OFFSET / 4];
        }

      bk7258_ap_mbox_ack(mbox);
    }

  return event;
}
#endif

