open-vela/contest2026_441_buzhidaojiaoshenmemingzi/chips/bk7258/cp/bk7258_ap_control.c
static void bk7258_ap_state_prepare(void)
{
  volatile struct bk7258_ap_boot_state_s *state = bk7258_ap_boot_state();
#ifdef CONFIG_BK7258_RPTUN_MBOX
  volatile struct bk7258_rptun_control_s *rptun = bk7258_rptun_control();
#endif
  uint32_t generation = 1;

  if (state->magic == BK7258_AP_BOOT_STATE_MAGIC &&
      state->version == BK7258_AP_BOOT_STATE_VERSION)
    {
      generation = state->generation + 1;
    }

  memset((void *)(uintptr_t)state, 0,
         sizeof(struct bk7258_ap_boot_state_s));
  bk7258_ap_fault_state()->magic = 0;
  bk7258_cpu2_probe_state()->magic = 0;
  bk7258_ap_ipi_state()->magic = 0;
  bk7258_ap_smp_state()->magic = 0;
  bk7258_ap_affinity_state()->magic = 0;
  bk7258_ap_sem_wake_state()->magic = 0;
  bk7258_ap_sem_wake_loop_state()->magic = 0;
  bk7258_ap_bp2p_state()->magic = 0;
  bk7258_ap_bdul_state()->magic = 0;
  bk7258_ap_bmig_state()->magic = 0;
  bk7258_ap_btim_state()->magic = 0;
  bk7258_ap_blcy_state()->magic = 0;
#ifdef CONFIG_BK7258_RPTUN_MBOX
  memset((void *)(uintptr_t)BK7258_RPTUN_SHMEM_BASE, 0,
         BK7258_RPTUN_SHMEM_SIZE);
  rptun->version = BK7258_RPTUN_CONTROL_VERSION;
  rptun->size = sizeof(*rptun);
  rptun->generation = generation;
  rptun->state = BK7258_RPTUN_STATE_OFFLINE;
  rptun->cp_epoch = generation;
  __asm volatile ("dmb sy" ::: "memory");
  rptun->magic = BK7258_RPTUN_CONTROL_MAGIC;
#endif
  state->magic       = BK7258_AP_BOOT_STATE_MAGIC;
  state->version     = BK7258_AP_BOOT_STATE_VERSION;
  state->size        = sizeof(struct bk7258_ap_boot_state_s);
  state->generation  = generation;
  state->command     = BK7258_AP_COMMAND_START;
  state->state       = BK7258_AP_STATE_STARTING;
  state->ram_start   = BK7258_AP_RAM_BASE;
  state->ram_end     = BK7258_AP_RAM_BASE + BK7258_AP_RAM_SIZE;
  state->flash_start = g_bk7258_ap_image.slot_start;
  state->flash_end   = g_bk7258_ap_image.slot_end;
  volatile struct bk7258_psram_boot_s *psram =
    (volatile struct bk7258_psram_boot_s *)
      (BK7258_SHARED_RAM_BASE + BK7258_PSRAM_BOOT_OFFSET);
  psram->magic = 0;
#ifdef CONFIG_BK7258_PSRAM
  struct bk7258_psram_info_s info;
  if (bk7258_psram_get_info(&info) == 0 && info.ready && info.mpu_valid)
    {
      psram->version = BK7258_PSRAM_BOOT_VERSION;
      psram->generation = generation;
      psram->capacity = info.capacity;
      __asm volatile ("dmb sy" ::: "memory");
      psram->magic = BK7258_PSRAM_BOOT_MAGIC;
    }
#endif
  __asm volatile ("dmb sy" ::: "memory");
}

static int bk7258_ap_start_fail(
  volatile struct bk7258_ap_boot_state_s *state, int ret,
  uint32_t fallback_error)
{
#ifdef CONFIG_BK7258_RPTUN
  int quiesce_ret;
#endif

  /* Every failure after the destructive reset normalization must publish a
   * state that can never be mistaken for a still-running AP.  In particular,
   * mailbox/RPTUN failures can happen before state_prepare() replaces an old
   * READY record.  Keep any AP-published diagnostic, otherwise report the CP
   * lifecycle failure supplied by the caller.
   */

  /* A completed RPTUN probe can be powered off synchronously and permits a
   * later retry.  NuttX deliberately rejects teardown while the asynchronous
   * probe is only PREPARING/TABLE_READY/CONNECTING; in that case no safe
   * cancellation API exists, so fail closed until a whole-chip reset rather
   * than letting the next start reuse a partial vdev.
   */

#ifdef CONFIG_BK7258_RPTUN
  quiesce_ret = bk7258_rptun_quiesce();
  if (quiesce_ret < 0)
    {
      g_bk7258_ap_faulted = true;
    }
#endif

  bk7258_cpu2_sdk_stop();
  bk7258_cpu1_sdk_stop();
  up_mdelay(BK7258_AP_RESTART_DELAY_MS);

  if (state->magic != BK7258_AP_BOOT_STATE_MAGIC ||
      state->version != BK7258_AP_BOOT_STATE_VERSION ||
      state->size != sizeof(*state))
    {
      memset((void *)(uintptr_t)state, 0, sizeof(*state));
      state->magic = BK7258_AP_BOOT_STATE_MAGIC;
      state->version = BK7258_AP_BOOT_STATE_VERSION;
      state->size = sizeof(*state);
      state->ram_start = BK7258_AP_RAM_BASE;
      state->ram_end = BK7258_AP_RAM_BASE + BK7258_AP_RAM_SIZE;
      state->flash_start = g_bk7258_ap_image.slot_start;
      state->flash_end = g_bk7258_ap_image.slot_end;
    }

  if (state->state != BK7258_AP_STATE_FAILED ||
      state->error == BK7258_AP_ERROR_NONE)
    {
      state->error = fallback_error;
    }

  state->command = BK7258_AP_COMMAND_NONE;
  state->state = BK7258_AP_STATE_FAILED;
  state->last_event = BK7258_AP_EVENT_FAILED;
  __asm volatile ("dmb sy" ::: "memory");
  return ret;
}

static bool bk7258_ap_scheduler_online(void)
{
  volatile struct bk7258_ap_boot_state_s *state = bk7258_ap_boot_state();
  volatile struct bk7258_cpu2_probe_state_s *cpu2 =
    bk7258_cpu2_probe_state();

  __asm volatile ("dmb sy" ::: "memory");
  return cpu2->magic == BK7258_CPU2_PROBE_STATE_MAGIC &&
         cpu2->version == BK7258_CPU2_PROBE_STATE_VERSION &&
         cpu2->size == sizeof(struct bk7258_cpu2_probe_state_s) &&
         cpu2->generation == state->generation &&
         cpu2->state == BK7258_CPU2_PROBE_STATE_SCHEDULER_ONLINE &&
         cpu2->online_mask == 0x3u;
}

#ifdef CONFIG_BK7258_WIFI_VNET
static bool bk7258_ap_wifi_generation_started(void)
{
  volatile struct bk7258_ap_boot_state_s *state = bk7258_ap_boot_state();

  __asm volatile ("dmb sy" ::: "memory");
  return bk7258_wifi_controller_active() &&
         state->magic == BK7258_AP_BOOT_STATE_MAGIC &&
         state->version == BK7258_AP_BOOT_STATE_VERSION &&
         state->size == sizeof(*state) && state->generation != 0;
}
#endif

#if defined(CONFIG_BK7258_BT_IPC) && defined(CONFIG_BK7258_RPTUN_MBOX)
static int bk7258_ap_bt_controller_service(uint32_t wanted)
{
  volatile struct bk7258_ap_boot_state_s *state = bk7258_ap_boot_state();
  volatile struct bk7258_rptun_control_s *control =
    bk7258_rptun_control();
  uint32_t flags;

  if (wanted != BK7258_AP_STATE_READY)
    {
      return OK;
    }

  __asm volatile ("dmb sy" ::: "memory");
  if (control->magic != BK7258_RPTUN_CONTROL_MAGIC ||
      control->version != BK7258_RPTUN_CONTROL_VERSION ||
      control->size != sizeof(*control) ||
      control->generation != state->generation)
    {
      return -EPROTO;
    }

