open-vela/contest2026_441_buzhidaojiaoshenmemingzi/chips/bk7258/cp/bk7258_ap_control.c
  flags = __atomic_load_n(&control->flags, __ATOMIC_ACQUIRE);
  if ((flags & BK7258_RPTUN_FLAG_AP_BT_IPC_READY) == 0 ||
      (flags & BK7258_RPTUN_FLAG_CP_BT_READY) != 0)
    {
      return OK;
    }

  /* CP bt_ipc was initialized before AP release.  Once AP publishes its
   * endpoint, acknowledge that both mailbox workers are ready and let AP
   * issue the official vendor-init command.  The CP SDK bt_ipc worker must
   * remain the sole caller that starts the Controller; pre-starting it here
   * creates early HCI/free traffic outside the SDK's ownership sequence.
   */

  __atomic_fetch_or(&control->flags, BK7258_RPTUN_FLAG_CP_BT_READY,
                    __ATOMIC_RELEASE);
  return OK;
}
#endif

static int bk7258_ap_wait(uint32_t wanted, uint32_t timeout_ms)
{
  volatile struct bk7258_ap_boot_state_s *state = bk7258_ap_boot_state();
  clock_t start;
  clock_t timeout_ticks;
  uint32_t event;

  if (timeout_ms == 0)
    {
      timeout_ms = BK7258_AP_DEFAULT_TIMEOUT_MS;
    }

  timeout_ticks = MSEC2TICK(timeout_ms);
  start = clock_systime_ticks();

  for (;;)
    {
      event = bk7258_ap_mbox_receive();
      if (event != BK7258_AP_EVENT_NONE)
        {
          state->last_event = event;
        }

#if defined(CONFIG_BK7258_BT_IPC) && defined(CONFIG_BK7258_RPTUN_MBOX)
      {
        int ret = bk7258_ap_bt_controller_service(wanted);

        if (ret < 0)
          {
            return ret;
          }
      }
#endif

      __asm volatile ("dmb sy" ::: "memory");
      if (state->state == wanted)
        {
          return OK;
        }

      if (state->state == BK7258_AP_STATE_FAILED)
        {
          return -EIO;
        }

      if ((clock_t)(clock_systime_ticks() - start) >= timeout_ticks)
        {
          break;
        }

      /* Yield to the CP idle thread while waiting.  A pure busy-poll at the
       * NSH task priority prevents the board task watchdog from being fed and
       * can reset CP before the 15-second AP timeout expires.  This mirrors
       * the SDK's scheduled millisecond-delay model while the absolute tick
       * comparison above remains the authoritative timeout.
       */

      nxsig_usleep(1000);
    }

  return -ETIMEDOUT;
}

#ifdef CONFIG_BK7258_RPTUN
static int bk7258_rptun_wait_quiesce_ready(uint32_t generation,
                                          uint32_t timeout_ms)
{
  volatile struct bk7258_rptun_control_s *control =
    bk7258_rptun_control();
  clock_t start;
  clock_t timeout_ticks;
  uint32_t flags;
  uint32_t state;

  if (timeout_ms == 0)
    {
      timeout_ms = BK7258_AP_DEFAULT_TIMEOUT_MS;
    }

  timeout_ticks = MSEC2TICK(timeout_ms);
  start = clock_systime_ticks();

  for (;;)
    {
      __asm volatile ("dmb sy" ::: "memory");
      if (control->magic != BK7258_RPTUN_CONTROL_MAGIC ||
          control->version != BK7258_RPTUN_CONTROL_VERSION ||
          control->size != sizeof(*control) ||
          control->generation != generation)
        {
          return -EPROTO;
        }

      state = control->state;
      flags = control->flags;
      if (state == BK7258_RPTUN_STATE_CONNECTED ||
          state == BK7258_RPTUN_STATE_OFFLINE ||
          (state == BK7258_RPTUN_STATE_FAULTED &&
           (flags & BK7258_RPTUN_FLAG_CONNECTED_ONCE) != 0))
        {
          return OK;
        }

      if (state == BK7258_RPTUN_STATE_FAULTED)
        {
          return -EIO;
        }

      if (state != BK7258_RPTUN_STATE_PREPARING &&
          state != BK7258_RPTUN_STATE_TABLE_READY &&
          state != BK7258_RPTUN_STATE_CONNECTING)
        {
          return -EBUSY;
        }

      if ((clock_t)(clock_systime_ticks() - start) >= timeout_ticks)
        {
          /* Do not return -ETIMEDOUT: bk7258_ap_restart() deliberately
           * continues after an AP stop timeout, while this condition means
           * the CP RPTUN vdev is still unsafe to destroy or replace.
           */

          return -EBUSY;
        }

      nxsig_usleep(1000);
    }
}
#endif

static int bk7258_ap_start_locked(uint32_t timeout_ms)
{
  volatile struct bk7258_ap_boot_state_s *state = bk7258_ap_boot_state();
  int ret;

#ifdef CONFIG_BK7258_PSRAM
  /* AP is a direct-memory consumer, never a PSRAM hardware owner.  Refuse
   * manual as well as automatic release unless the CP driver and heap gate
   * completed successfully for this SoC boot.
   */

  if (!bk7258_psram_ready())
    {
      return -ENODEV;
    }
#endif

  /* Shared SRAM survives some whole-chip reset paths.  Only reject a second
   * start when this CP boot actually released AP; a retained READY header
   * from the previous boot must be normalized below.
   */

  if (g_bk7258_ap_live_this_boot &&
      state->magic == BK7258_AP_BOOT_STATE_MAGIC &&
      (state->state == BK7258_AP_STATE_READY ||
       state->state == BK7258_AP_STATE_STARTING))
    {
      return -EBUSY;
    }

  /* Stop the AP SMP secondary before its primary.  Resetting physical CPU1
   * first would leave scheduler-online physical CPU2 running without the
   * primary CPU, a state NuttX SMP does not support.
   */

  g_bk7258_ap_live_this_boot = false;
  bk7258_cpu2_sdk_stop();
  bk7258_cpu1_sdk_stop();
  up_mdelay(BK7258_AP_RESTART_DELAY_MS);

  ret = bk7258_ap_mbox_initialize();
  if (ret < 0)
    {
      return bk7258_ap_start_fail(state, ret,
                                  BK7258_AP_ERROR_BAD_BOOT_STATE);
    }

#ifdef CONFIG_BK7258_RPTUN
  /* Stop the persistent CP-side RPTUN worker before state_prepare() clears
   * the shared table/carveout.  This is a no-op on the initial boot.
   */

  ret = bk7258_rptun_quiesce();
  if (ret < 0)
    {
      return bk7258_ap_start_fail(state, ret,
                                  BK7258_AP_ERROR_BAD_BOOT_STATE);
    }
#endif

  bk7258_ap_state_prepare();

#ifdef CONFIG_BK7258_RPTUN
  ret = bk7258_rptun_initialize(state->generation);
  if (ret < 0)
    {
      return bk7258_ap_start_fail(state, ret,
                                  BK7258_AP_ERROR_BAD_BOOT_STATE);
    }
#endif

  /* Release order matches the BK7258 CP SDK.  The reset+power-down pulse
   * above is an intentional cold-start normalization step: unlike the SDK's
   * one-shot boot path, this controller must also survive downloader reset
   * residue and repeated AP restart attempts with private caches populated.
   * The official PM vote is not equivalent to pwr_dw=0: it also clears the
   * CPU1 halt bit, restores its clock, and waits for that clock to settle.
   */

  ret = bk_pm_module_vote_power_ctrl(BK7258_SDK_PM_POWER_MODULE_CPU1,
                                     BK7258_SDK_PM_POWER_ON);
  if (ret != 0)
    {
      return bk7258_ap_start_fail(state, -EIO,
                                  BK7258_AP_ERROR_BAD_BOOT_STATE);
    }

