open-vela/contest2026_441_buzhidaojiaoshenmemingzi/chips/bk7258/cp/bk7258_ap_control.c
  sys_drv_set_cpu1_pwr_dw(0);
  sys_drv_set_cpu1_rxevt_sel(1);
  /* A MCUboot-signed AP slot starts with its 0x200-byte image header.  CPU1
   * has no MCUboot parser of its own: BL2 validated the pair before it
   * launched CP, and CP must release CPU1 at the AP vector table itself.
   */

  sys_drv_set_cpu1_boot_address_offset(
    g_bk7258_ap_image.vector_addr >> 8);
  __asm volatile ("dsb sy; isb sy" ::: "memory");

  sys_drv_set_cpu1_reset(1);
  __asm volatile ("dsb sy; sev" ::: "memory");

  ret = bk7258_ap_wait(BK7258_AP_STATE_READY, timeout_ms);
  if (ret < 0)
    {
      return bk7258_ap_start_fail(state, ret, BK7258_AP_ERROR_TIMEOUT);
    }

  g_bk7258_ap_live_this_boot = true;
  return ret;
}

static int bk7258_ap_stop_locked(uint32_t timeout_ms)
{
  volatile struct bk7258_ap_boot_state_s *state = bk7258_ap_boot_state();
  bool scheduler_online = bk7258_ap_scheduler_online();
  int ret = OK;

#ifdef CONFIG_BK7258_RPTUN
  /* NuttX starts RPTUN in a worker, so AP READY can precede completion of
   * rpmsg_virtio_probe().  Wait for the Name Service connection proof before
   * asking NuttX to remove the vdev.  Otherwise a rapid cycle can tear down a
   * partially probed vdev and fault inside rpmsg_virtio_remove().
   */

  if (state->magic == BK7258_AP_BOOT_STATE_MAGIC &&
      state->version == BK7258_AP_BOOT_STATE_VERSION &&
      state->size == sizeof(*state) &&
      state->state != BK7258_AP_STATE_OFF &&
      state->state != BK7258_AP_STATE_STOPPED)
    {
      ret = bk7258_rptun_wait_quiesce_ready(state->generation, timeout_ms);
      if (ret < 0)
        {
          return ret;
        }
    }

  ret = bk7258_rptun_quiesce();
  if (ret < 0)
    {
      return ret;
    }
#endif

  /* NuttX SMP has no supported logical-CPU hot-unplug sequence here.  When
   * CPU2 is scheduler-online, skip the in-band STOP command and reset both AP
   * physical cores after the transport is quiesced.  Non-SMP/probe builds
   * retain the original graceful handshake.
   */

  if (!scheduler_online &&
      (state->state == BK7258_AP_STATE_READY ||
       state->state == BK7258_AP_STATE_STARTING))
    {
      state->command = BK7258_AP_COMMAND_STOP;
      __asm volatile ("dmb sy" ::: "memory");
      bk7258_ap_mbox_send(BK7258_AP_EVENT_STOP);
      ret = bk7258_ap_wait(BK7258_AP_STATE_STOPPED, timeout_ms);
    }

  /* A timeout still ends in a deterministic forced stop of both AP cores.
   * Stop the SMP secondary first so it cannot execute after its primary is
   * held in reset.
   */

  bk7258_cpu2_sdk_stop();
  bk7258_cpu1_sdk_stop();
  up_mdelay(BK7258_AP_RESTART_DELAY_MS);
  g_bk7258_ap_live_this_boot = false;

  if (ret < 0 && state->state != BK7258_AP_STATE_FAILED)
    {
      state->error = BK7258_AP_ERROR_TIMEOUT;
    }

  state->command = BK7258_AP_COMMAND_NONE;
  state->state = BK7258_AP_STATE_STOPPED;
  state->last_event = BK7258_AP_EVENT_STOPPED;
  __asm volatile ("dmb sy" ::: "memory");
  return ret;
}

/****************************************************************************
 * Public Functions
 ****************************************************************************/

int bk7258_ap_control_initialize(
  const struct bk7258_ap_image_desc_s *image)
{
  int ret = OK;

  if (!bk7258_ap_image_valid(image))
    {
      return -EINVAL;
    }

  ret = nxmutex_lock(&g_bk7258_ap_lock);
  if (ret < 0)
    {
      return ret;
    }

  if (g_bk7258_ap_faulted)
    {
      ret = -ESHUTDOWN;
    }
  else if (!g_bk7258_ap_initialized)
    {
      g_bk7258_ap_image = *image;
      ret = bk7258_ap_mbox_initialize();
      if (ret >= 0)
        {
          g_bk7258_ap_initialized = true;
        }
    }
  else if (memcmp(&g_bk7258_ap_image, image, sizeof(*image)) != 0)
    {
      ret = -EBUSY;
    }

  nxmutex_unlock(&g_bk7258_ap_lock);
  return ret;
}

#ifdef CONFIG_BK7258_PM_COORDINATED_STANDBY
int bk7258_ap_pm_notify(uint32_t event)
{
  volatile struct bk7258_ap_boot_state_s *state = bk7258_ap_boot_state();
  int ret;

  if (event != BK7258_AP_EVENT_STANDBY_REQUEST &&
      event != BK7258_AP_EVENT_STANDBY_ABORT &&
      event != BK7258_AP_EVENT_STANDBY_WAKE)
    {
      return -EINVAL;
    }

  __asm volatile ("dmb sy" ::: "memory");
  if (state->state != BK7258_AP_STATE_READY || state->generation == 0)
    {
      return -EHOSTDOWN;
    }

  ret = bk7258_rptun_mbox_send(BK7258_RPTUN_MBOX_LIFECYCLE,
                                state->generation, event);
  if (ret >= 0)
    {
      state->cp_to_ap_doorbells++;
      __asm volatile ("dmb sy; sev" ::: "memory");
    }

  return ret;
}
#endif

int bk7258_ap_start(uint32_t timeout_ms)
{
  int ret;

  ret = nxmutex_lock(&g_bk7258_ap_lock);
  if (ret < 0)
    {
      return ret;
    }

  if (!g_bk7258_ap_initialized)
    {
      nxmutex_unlock(&g_bk7258_ap_lock);
      return -ENODEV;
    }

  if (g_bk7258_ap_faulted)
    {
      nxmutex_unlock(&g_bk7258_ap_lock);
      return -ESHUTDOWN;
    }

#ifdef CONFIG_BK7258_WIFI_VNET
  if (bk7258_ap_wifi_generation_started())
    {
      nxmutex_unlock(&g_bk7258_ap_lock);
      return -EBUSY;
    }
#endif

#ifdef CONFIG_BK7258_AP_SUPERVISOR
  bk7258_ap_supervisor_lifecycle_begin();
#endif
  ret = bk7258_ap_start_locked(timeout_ms);
#ifdef CONFIG_BK7258_AP_SUPERVISOR
  bk7258_ap_supervisor_lifecycle_end();
#endif
  nxmutex_unlock(&g_bk7258_ap_lock);
  return ret;
}

int bk7258_ap_stop(uint32_t timeout_ms)
{
  int ret;

  ret = nxmutex_lock(&g_bk7258_ap_lock);
  if (ret < 0)
    {
      return ret;
    }

  if (!g_bk7258_ap_initialized)
    {
      nxmutex_unlock(&g_bk7258_ap_lock);
      return -ENODEV;
    }

  if (g_bk7258_ap_faulted)
    {
      nxmutex_unlock(&g_bk7258_ap_lock);
      return -ESHUTDOWN;
    }

#ifdef CONFIG_BK7258_WIFI_VNET
  /* The official v3.1.1.9 controller has no supported Wi-Fi deinit path.
   * Resetting AP alone can therefore strand CP-owned vnet pointers and open
   * mailbox channels.  Whole-chip reset is the bounded recovery operation.
   */

  if (bk7258_wifi_controller_active())
    {
      nxmutex_unlock(&g_bk7258_ap_lock);
      return -EBUSY;
    }
#endif

#ifdef CONFIG_BK7258_AP_SUPERVISOR
  bk7258_ap_supervisor_lifecycle_begin();
#endif
  ret = bk7258_ap_stop_locked(timeout_ms);
#ifdef CONFIG_BK7258_AP_SUPERVISOR
  bk7258_ap_supervisor_lifecycle_end();
#endif
  nxmutex_unlock(&g_bk7258_ap_lock);
  return ret;
}

int bk7258_ap_restart(uint32_t timeout_ms)
{
  int ret;

