open-vela/contest2026_441_buzhidaojiaoshenmemingzi/chips/bk7258/cp/bk7258_ap_control.c
  ret = nxmutex_lock(&g_bk7258_ap_lock);
  if (ret < 0)
    {
      return ret;
    }

  if (!g_bk7258_ap_initialized)
    {
      nxmutex_unlock(&g_bk7258_ap_lock);
      return -ENODEV;
    }

  if (g_bk7258_ap_faulted)
    {
      nxmutex_unlock(&g_bk7258_ap_lock);
      return -ESHUTDOWN;
    }

#ifdef CONFIG_BK7258_WIFI_VNET
  if (bk7258_wifi_controller_active())
    {
      nxmutex_unlock(&g_bk7258_ap_lock);
      return -EBUSY;
    }
#endif

#ifdef CONFIG_BK7258_AP_SUPERVISOR
  bk7258_ap_supervisor_lifecycle_begin();
#endif
  ret = bk7258_ap_stop_locked(timeout_ms);
  if (ret == OK || ret == -ETIMEDOUT)
    {
      up_mdelay(BK7258_AP_RESTART_DELAY_MS);
      ret = bk7258_ap_start_locked(timeout_ms);
    }
#ifdef CONFIG_BK7258_AP_SUPERVISOR
  bk7258_ap_supervisor_lifecycle_end();
#endif

  nxmutex_unlock(&g_bk7258_ap_lock);
  return ret;
}

int bk7258_ap_ipi_test(uint32_t count, uint32_t timeout_ms)
{
  volatile struct bk7258_ap_boot_state_s *state = bk7258_ap_boot_state();
  volatile struct bk7258_ap_ipi_state_s *ipi = bk7258_ap_ipi_state();
  uint32_t elapsed;
  uint32_t event;
  int ret;

  if (count == 0)
    {
      count = BK7258_AP_IPI_DEFAULT_COUNT;
    }

  if (timeout_ms == 0)
    {
      timeout_ms = BK7258_AP_IPI_DEFAULT_TIMEOUT_MS;
    }

  if (count > BK7258_AP_IPI_MAX_COUNT)
    {
      return -ERANGE;
    }

  ret = nxmutex_lock(&g_bk7258_ap_lock);
  if (ret < 0)
    {
      return ret;
    }

  __asm volatile ("dmb sy" ::: "memory");
  if (bk7258_ap_scheduler_online())
    {
      ret = -ENOTSUP;
      goto out;
    }

  if (state->state != BK7258_AP_STATE_READY ||
      ipi->magic != BK7258_AP_IPI_STATE_MAGIC ||
      ipi->version != BK7258_AP_IPI_STATE_VERSION ||
      ipi->size != sizeof(struct bk7258_ap_ipi_state_s) ||
      ipi->generation != state->generation)
    {
      ret = -EAGAIN;
      goto out;
    }

  if (ipi->state == BK7258_AP_IPI_STATE_RUNNING ||
      ipi->state == BK7258_AP_IPI_STATE_REQUESTED)
    {
      ret = -EBUSY;
      goto out;
    }

  ipi->requested_count = count;
  ipi->completed_count = 0;
  ipi->timeout_ms = timeout_ms;
  ipi->error = BK7258_AP_IPI_ERROR_NONE;
  ipi->state = BK7258_AP_IPI_STATE_REQUESTED;
  state->command = BK7258_AP_COMMAND_IPI_TEST;
  __asm volatile ("dmb sy" ::: "memory");
  bk7258_ap_mbox_send(BK7258_AP_EVENT_IPI_TEST);

  ret = -ETIMEDOUT;
  for (elapsed = 0; elapsed < timeout_ms; elapsed++)
    {
      event = bk7258_ap_mbox_receive();
      if (event != BK7258_AP_EVENT_NONE)
        {
          state->last_event = event;
        }

      __asm volatile ("dmb sy" ::: "memory");
      if (ipi->state == BK7258_AP_IPI_STATE_PASSED)
        {
          ret = OK;
          break;
        }

      if (ipi->state == BK7258_AP_IPI_STATE_FAILED ||
          state->state == BK7258_AP_STATE_FAILED)
        {
          ret = -EIO;
          break;
        }

      nxsig_usleep(1000);
    }

out:
  nxmutex_unlock(&g_bk7258_ap_lock);
  return ret;
}

void bk7258_ap_get_status(struct bk7258_ap_boot_state_s *status)
{
  volatile struct bk7258_ap_boot_state_s *state = bk7258_ap_boot_state();

  if (status != NULL)
    {
      __asm volatile ("dmb sy" ::: "memory");
      memcpy(status, (const void *)(uintptr_t)state, sizeof(*status));
      __asm volatile ("dmb sy" ::: "memory");
    }
}

int bk7258_ap_cp_clock_transition_begin(void)
{
  volatile struct bk7258_ap_boot_state_s *state = bk7258_ap_boot_state();
  int ret;

  /* Serialize a CP-local shared-clock transition with initialize/start/stop/
   * restart.  The caller keeps this gate until the transition is complete,
   * closing the state-check/start race.  AP-originated PM requests do not use
   * this gate because their reply path refreshes the AP timebase.
   */

  ret = nxmutex_lock(&g_bk7258_ap_lock);
  if (ret < 0)
    {
      return ret;
    }

  if (g_bk7258_ap_initialized)
    {
      __asm volatile ("dmb sy" ::: "memory");
      if (state->state != BK7258_AP_STATE_OFF &&
          state->state != BK7258_AP_STATE_STOPPED)
        {
          nxmutex_unlock(&g_bk7258_ap_lock);
          return -EBUSY;
        }
    }

  return OK;
}

void bk7258_ap_cp_clock_transition_end(void)
{
  nxmutex_unlock(&g_bk7258_ap_lock);
}
